In [47]:
# 판다스 설치
!pip install pandas

Requirement already satisfied: pandas in c:\users\krcea\appdata\local\programs\python\python314\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\krcea\appdata\local\programs\python\python314\lib\site-packages (from pandas) (2.4.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\krcea\appdata\roaming\python\python314\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\krcea\appdata\local\programs\python\python314\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\krcea\appdata\local\programs\python\python314\lib\site-packages (from pandas) (2025.3)
Requirement already satisfied: six>=1.5 in c:\users\krcea\appdata\roaming\python\python314\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [48]:
import pandas

In [49]:
# 시리즈(Series)

menu = pandas.Series(["비빔밥", "김치찌개", "된장찌개"])
print(menu)

0     비빔밥
1    김치찌개
2    된장찌개
dtype: object

In [50]:
type(menu)

# 판다스의 하나의 형태인 시리즈

pandas.core.series.Series

In [51]:
price = pandas.Series([1000, 2000, 3000])

print(price)

0    1000
1    2000
2    3000
dtype: int64

In [52]:
# 데이터프레임(DataFrame)

import pandas as pd

# 중괄호가 나왔다면 키와 벨류 한쌍의 데이터를 입력했다고 보면 됨

df = pd.DataFrame({
    "메뉴": menu,
    
    "가격": price
})

print(df)

     메뉴    가격
0   비빔밥  1000
1  김치찌개  2000
2  된장찌개  3000

In [53]:
df = pd.DataFrame({
    "메뉴": ["비빔밥", "김치찌개", "된장찌개"],
    "가격": [1000, 2000, 3000],
    "원산지": ["한국", "한국", "한국"]
})

# 위에 값이 3개이면 밑에 값도 3개 동일하게 넣어줘야함

df

     메뉴    가격 원산지
0   비빔밥  1000  한국
1  김치찌개  2000  한국
2  된장찌개  3000  한국

In [54]:
# 컬럼 선택
print(df["메뉴"])
print(df["가격"])

0     비빔밥
1    김치찌개
2    된장찌개
Name: 메뉴, dtype: object
0    1000
1    2000
2    3000
Name: 가격, dtype: int64

In [55]:
df[["메뉴", "가격"]]

     메뉴    가격
0   비빔밥  1000
1  김치찌개  2000
2  된장찌개  3000

In [56]:
df[["메뉴"]]

     메뉴
0   비빔밥
1  김치찌개
2  된장찌개

In [57]:
# 02. 데이터 저장 및 불러오기

data = {
    "메뉴": ["아메리카노", "카페라떼", "카페모카", "카푸치노", "에스프레소", "밀크티", "녹차"],
    "가격": [1500, 2000, 3000, 2000, 1500, 3000, 4000],
    "칼로리": [10, 110, 250, 110, 20, 210, 0]
}

df = pd.DataFrame(data)

df

      메뉴    가격  칼로리
0  아메리카노  1500   10
1   카페라떼  2000  110
2   카페모카  3000  250
3   카푸치노  2000  110
4  에스프레소  1500   20
5    밀크티  3000  210
6     녹차  4000    0

In [62]:
df.to_csv("temp.csv", index = False)

In [64]:
temp = pd.read_csv("temp.csv")

temp

      메뉴    가격  칼로리
0  아메리카노  1500   10
1   카페라떼  2000  110
2   카페모카  3000  250
3   카푸치노  2000  110
4  에스프레소  1500   20
5    밀크티  3000  210
6     녹차  4000    0

In [67]:
# 03. 탐색적 데이터 분석(EDA)

# 어떤 데이터를 가져왔을 때 어떤 타입인지 분석해야함

df = pd.read_csv("temp.csv")

print(df.head()) # df.head하면 상위 5개 행만 가져옴 -> 수천개 행이 있을 때 먼저 조금 볼려고 
print(df.head(2)) # 이러면 2개만 가져옴.

print(df.tail()) # 하위 5개
print(df.tail(1)) # 마지막 값

      메뉴    가격  칼로리
0  아메리카노  1500   10
1   카페라떼  2000  110
2   카페모카  3000  250
3   카푸치노  2000  110
4  에스프레소  1500   20
      메뉴    가격  칼로리
0  아메리카노  1500   10
1   카페라떼  2000  110
      메뉴    가격  칼로리
2   카페모카  3000  250
3   카푸치노  2000  110
4  에스프레소  1500   20
5    밀크티  3000  210
6     녹차  4000    0
   메뉴    가격  칼로리
6  녹차  4000    0

In [70]:
# 데이터 프레임의 크기
print(df.shape) # 행 7개 열 3개 얘는 괄호 없음. -> 속성(property) 위에 df head()처럼 괄호 있는건 다른건데 먼지 못들음

(7, 3)

In [73]:
# 컬럼별 자료형
df.info() # Dtype은 먼 type 인지 알려줌
# 나중에 머신러닝 돌려야되는데 object 형태의 데이터 타입은 머신러닝 못돌림 -> 인코딩(숫자와 연결시켜주는) 해야함
# shape나 info는 시험에 나옴

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      int64
 2   칼로리     7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes

In [76]:
# 상관관계
df.corr(numeric_only=True)

           가격       칼로리
가격   1.000000  0.253085
칼로리  0.253085  1.000000

In [83]:
# 고유한 값의 개수
data = {
    "car" : ["Sedan", "SUV", "Sedan", "SUV", "SUV", "Sedan", "Sedan", "Sedan", "Sedan", "SUV"],
    "size" : ["S", "M", "S", "M", "M", "S", "S", "S", "S", "M"]
}
df_car = pd.DataFrame(data)
df_car.head(3)

df_car.nunique() # 엄청나게 많을 수 있으니까 고유값이 몇개인지 확인 # 유니크한 값을 구한다.

car     2
size    2
dtype: int64

In [85]:
df_car.value_counts()
print(df_car["car"].value_counts())
print(df_car["size"].value_counts())

car
Sedan    6
SUV      4
Name: count, dtype: int64
size
S    6
M    4
Name: count, dtype: int64

In [88]:
# 기술통계
print(df.describe())
print(df_car.describe())

                가격         칼로리
count     7.000000    7.000000
mean   2428.571429  101.428571
std     932.227236   99.402980
min    1500.000000    0.000000
25%    1750.000000   15.000000
50%    2000.000000  110.000000
75%    3000.000000  160.000000
max    4000.000000  250.000000
          car size
count      10   10
unique      2    2
top     Sedan    S
freq        6    6

In [91]:
# 기술통계(object 자료형)

df.describe(include="object")
# df.describe(include = "0")

           메뉴
count       7
unique      7
top     아메리카노
freq        1

In [95]:
# 4. 자료형 변환
data = {
    "메뉴": ["아메리카노", "카페라떼", "카페모카", "카푸치노", "에스프레소", "밀크티", "녹차"],
    "가격": [1500.0, 2000.0, 3000.0, 2000.0, 1500.0, 3000.0, 4000.0],
    "칼로리": [10, 110, 250, 110, 20, 210, 0]
}

df = pd.DataFrame(data)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      float64
 2   칼로리     7 non-null      int64
dtypes: float64(1), int64(1), object(1)
memory usage: 300.0+ bytes

In [99]:
df["가격"] = df["가격"].astype(int)

In [100]:
df["가격"]

0    1500
1    2000
2    3000
3    2000
4    1500
5    3000
6    4000
Name: 가격, dtype: int64

In [101]:
df["가격"] = df["가격"].astype(float)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      float64
 2   칼로리     7 non-null      int64
dtypes: float64(1), int64(1), object(1)
memory usage: 300.0+ bytes

In [103]:
# 5. 새로운 컬럼 추가
df = pd.read_csv("temp.csv")
df.head(2)

      메뉴    가격  칼로리
0  아메리카노  1500   10
1   카페라떼  2000  110

In [104]:
df["new"] = 0
df

      메뉴    가격  칼로리  new
0  아메리카노  1500   10    0
1   카페라떼  2000  110    0
2   카페모카  3000  250    0
3   카푸치노  2000  110    0
4  에스프레소  1500   20    0
5    밀크티  3000  210    0
6     녹차  4000    0    0

In [148]:
# 기존 컬럼을 사용한 계산
discount = 0.2
df["할인가격"] = df["가격"] * (1 - discount)
df

TypeError: 'NoneType' object is not subscriptable

In [149]:
# 6. 데이터 삭제

df = pd.read_csv("temp.csv")
df

      메뉴    가격  칼로리
0  아메리카노  1500   10
1   카페라떼  2000  110
2   카페모카  3000  250
3   카푸치노  2000  110
4  에스프레소  1500   20
5    밀크티  3000  210
6     녹차  4000    0

In [150]:
# 행 삭제
df = df.drop(1, axis=0)

In [151]:
df.drop(5, axis=0, inplace=True)

In [152]:
print(df)

      메뉴    가격  칼로리
0  아메리카노  1500   10
2   카페모카  3000  250
3   카푸치노  2000  110
4  에스프레소  1500   20
6     녹차  4000    0

In [155]:
# 컬럼(명) 삭제
df= df.drop("칼로리", axis=1)

In [156]:
df

      메뉴    가격
0  아메리카노  1500
2   카페모카  3000
3   카푸치노  2000
4  에스프레소  1500
6     녹차  4000